wlshiu/net/LPC1700/CMSIS/Driver/OTG_LPC17xx.c
/* --------------------------------------------------------------------------
 * Copyright (c) 2013-2016 ARM Limited. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * $Date:        02. March 2016
 * $Revision:    V1.2
 *
 * Project:      USB common (Device and Host) module for NXP LPC17xx
 * -------------------------------------------------------------------------- */

/* History:
 *  Version 1.2
 *    Added dependency on RTE_Device.h pin enable for LPC175x/6x
 *  Version 1.1
 *    Added U1 and U2 support for LPC177x/8x
 *    Changed include for renamed RTE_Device_LPC177x_8x.h to RTE_Device.h
 *  Version 1.0
 *    Initial release
 */

#if defined (LPC175x_6x)
  #include "LPC17xx.h"
  #include "PIN_LPC17xx.h"
#elif defined (LPC177x_8x)
  #include "LPC177x_8x.h"
  #include "PIN_LPC177x_8x.h"
#endif

#include "Driver_USB.h"

#include "RTE_Device.h"
#include "RTE_Components.h"

#if defined (LPC177x_8x)
#define IOCON_D_RST         (IOCON_MODE_PULLUP | IOCON_HYS_ENABLE)
#define IOCON_A_RST         (IOCON_MODE_PULLUP | IOCON_DIGITIAL_MODE | IOCON_10ns_FILTER_DISABLE)
#define IOCON_U_RST         (0)
#define IOCON_I_RST         (0)
#define IOCON_W_RST         (IOCON_HYS_ENABLE  | IOCON_DIGITIAL_MODE)
#define IOCON_D_USB         (IOCON_MODE_PULLUP | IOCON_HYS_ENABLE)
#define IOCON_A_USB         (IOCON_MODE_PULLUP | IOCON_DIGITIAL_MODE)
#define IOCON_U_USB         (0)
#define IOCON_I_USB         (0)
#define IOCON_W_USB         (IOCON_MODE_PULLUP | IOCON_HYS_ENABLE | IOCON_DIGITIAL_MODE)

#ifndef USB_I2C_OTG_TRANSCEIVER_ADDR
#define USB_I2C_OTG_TRANSCEIVER_ADDR   (0x2D)
#endif
#endif

extern void SystemCoreClockUpdate (void);

       uint8_t  usb_role     = ARM_USB_ROLE_NONE;
       uint8_t  usb_state    = 0U;
       uint8_t  usb_pin_cfg  = 0U;
#if defined (LPC177x_8x)
static uint8_t  usb_i2c_init = 0U;
//static uint16_t usb_i2c_id = 0U;
#endif

#ifdef RTE_Drivers_USBH0
extern void USBH_IRQ (void);
#endif
#ifdef RTE_Drivers_USBD0
extern void USBD_IRQ (void);
#endif


#if defined (LPC177x_8x)
/**
  \fn          int32_t USB_I2C_RegisterRead (void)
  \brief       Read I2C Device Register.
  \param[in]   i2c_addr  I2C Address
  \param[in]   reg_addr  Register Address
  \return                      register value
               - value 0..255: register value
               - value -1:     register read has failed
*/
int32_t USB_I2C_RegisterRead (uint8_t i2c_addr, uint8_t reg_addr) {

  if (usb_i2c_init == 0U) { return -1; }

  LPC_USB->I2C_TX = (      1U << 8) |           // START bit on transmit start
                    (i2c_addr << 1)             // I2C Address
                                    ;           // Write request
  while ((LPC_USB->I2C_STS & (1U << 11)) == 0U);// Wait for Tx FIFO empty
  LPC_USB->I2C_TX =  reg_addr;                  // Register address to read from
  while ((LPC_USB->I2C_STS & (1U << 11)) == 0U);// Wait for Tx FIFO empty
  LPC_USB->I2C_TX = (      1U << 8) |           // START bit on transmit start
                    (i2c_addr << 1) |           // I2C Address
                    (      1U     ) ;           // Read request
  LPC_USB->I2C_TX = (      1U << 9) |           // STOP bit on end
                        0x55U       ;           // Dummy data transmit to receive
  while ((LPC_USB->I2C_STS & 1U) == 0U);        // Wait for transaction done
  while ((LPC_USB->I2C_STS & (1U << 5)) != 0U); // Wait for STOP condition

  return (LPC_USB->I2C_RX & 0xFFU);
}

/**
  \fn          int32_t USB_I2C_RegisterWrite (void)
  \brief       Write I2C Device Register.
  \param[in]   i2c_addr  I2C Address
  \param[in]   reg_addr  Register Address
  \param[in]   reg_val   Register Value
  \return                      result of operation
               - value 0:      register written successfully
               - value -1:     register write has failed
*/
int32_t USB_I2C_RegisterWrite (uint8_t i2c_addr, uint8_t reg_addr, uint8_t reg_val) {

  if (usb_i2c_init == 0U) { return -1; }

  LPC_USB->I2C_TX = (      1U << 8) |           // START bit on transmit start
                    (i2c_addr << 1)             // I2C Address
                                    ;           // Write request
  while ((LPC_USB->I2C_STS & (1U << 11)) == 0U);// Wait for Tx FIFO empty
  LPC_USB->I2C_TX =  reg_addr;                  // Register address to write to
  while ((LPC_USB->I2C_STS & (1U << 11)) == 0U);// Wait for Tx FIFO empty
  LPC_USB->I2C_TX = (      1U << 9) |           // STOP bit on end
                     reg_val        ;           // Register value to write
  while ((LPC_USB->I2C_STS & (1U << 5)) != 0U); // Wait for STOP condition

  return 0;
}

/**
  \fn          int32_t USB_I2C_Initialize (void)
  \brief       Initialize USB I2C Interface.
  \return                  result of operation
               - value 0:  I2C initialized successfully
               - value -1: I2C initialization has failed
*/
int32_t USB_I2C_Initialize (void) {

  if (usb_i2c_init != 0U) { return 0U; }

  SystemCoreClockUpdate ();

  LPC_USB->OTGClkCtrl |= 0x04U;                 // Enable I2C clock
  while ((LPC_USB->OTGClkSt & 0x04U) == 0U);

  LPC_USB->I2C_CTL = 1U << 8;                   // I2C reset
  while ((LPC_USB->I2C_CTL & (1U << 8)) != 0U); // Wait reset end

                                                // Set I2C clock to 100kHz
  LPC_USB->I2C_CLKHI = USBClock/200000U;        // High clock period
  LPC_USB->I2C_CLKLO = USBClock/200000U;        // Low  clock period

